#include "S32K144.h"

#define PDLY_TIMEOUT		65000		// ms
#define cChnDelay			300			// 1.6us * 13 = 41us

/**************************************************************************************************
 名称：BSPPdbTriggerSoftware
 作用：进行一次软件触发，会启动一次PDB运行过程
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
void BSPPdbTriggerSoftware(PDB_Type * base)
{
	base->SC |= PDB_SC_SWTRIG(1);
}

/**************************************************************************************************
 名称：BSPPdbModuleInit
 作用：初始化PDB模块参数
 输入：base：pdb模块的地址
 返回：无
 描述： 暂不加载数据，关闭中断，关闭DMA，分频128，选择软件触发，使能模块，关闭中断，计数倍数为1，单次触发模式
**************************************************************************************************/
void BSPPdbModuleInit(PDB_Type * base)
{
	base->SC = PDB_SC_PDBEN(0u);			// 先关闭PDB模块

	base->SC = PDB_SC_LDMOD(0) + PDB_SC_PDBEIE(0) 				\
			  + PDB_SC_DMAEN(0) + PDB_SC_PRESCALER(7)			\
			  + PDB_SC_TRGSEL(0x0FU) + PDB_SC_PDBEN(0) 			\
			  + PDB_SC_PDBIE(0) + PDB_SC_MULT(0)  				\
			  + PDB_SC_CONT(0);

	base->MOD = PDLY_TIMEOUT;

	base->CH[0].C1 = 0;			// 清空通道0配置
	base->CH[1].C1 = 0;			// 清空通道1配置

	base->CH[0].S = 0;			// 清空通道0错误及状态
	base->CH[1].S = 0;			// 清空通道1错误及状态

	base->IDLY = 62500;			// 80M/128分频=625000为1s 100ms为62500，如果IDLY超时的话，就认为发生错误，复位模块

	base->SC |= PDB_SC_PDBEN(1u);			// 最后打开PDB模块
}

/**************************************************************************************************
 名称：BSPPdbChnInit
 作用：初始化通道配置：打开还是关闭，预触发是否打开
 输入：base：pdb模块的地址
 返回：无
 描述：打开某些通道，此处无法进行关闭
**************************************************************************************************/
void BSPPdbChnInit(PDB_Type * base, uint8_t chn)
{
	if (chn <= 7U)
	{
		base->CH[0].C1 |= PDB_C1_EN(1 << chn) + PDB_C1_TOS(1 << chn) + PDB_C1_BB(0);
		base->CH[0].DLY[chn] = cChnDelay * chn + 4;
	}
	else if (chn <= 15)
	{
		base->CH[1].C1 |= PDB_C1_EN(1 << (chn - 8)) + PDB_C1_TOS(1 << (chn - 8)) + PDB_C1_BB(0);
		base->CH[1].DLY[chn - 8] = cChnDelay * chn + 13;
	}
}

/**************************************************************************************************
 名称：BSPPdbLoadValues
 作用：写到缓冲区的计数值加载到寄存器，这个机制是用于同步功能
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
void BSPPdbLoadValues(PDB_Type * base)
{
	base->SC |= PDB_SC_LDOK(1);
}

/**************************************************************************************************
 名称：BSPPdbLoadValues
 作用：写到缓冲区的计数值加载到寄存器，这个机制是用于同步功能
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
uint16_t BSPPdb0GetErrStatus(void)
{
	uint16_t error;

	error = (PDB0->CH[0].S & 0xFF) + ((PDB0->CH[1].S & 0xFF) << 8);

	return error;
}

/**************************************************************************************************
 名称：BSPPdbLoadValues
 作用：写到缓冲区的计数值加载到寄存器，这个机制是用于同步功能
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
uint16_t BSPPdb1GetErrStatus(void)
{
	uint16_t error;

	error = (PDB1->CH[0].S & 0xFF) + ((PDB1->CH[1].S & 0xFF) << 8);

	return error;
}

/**************************************************************************************************
 名称：PDB_SC_PDBIF_SHIFT
 作用：写到缓冲区的计数值加载到寄存器，这个机制是用于同步功能
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
uint8_t BSPPdb0GetIfStatus(void)
{
	uint8_t status;

	status = (PDB0->SC >> PDB_SC_PDBIF_SHIFT) & 0x01U;

	return status;
}

/**************************************************************************************************
 名称：PDB_SC_PDBIF_SHIFT
 作用：写到缓冲区的计数值加载到寄存器，这个机制是用于同步功能
 输入：base：pdb模块的地址
 返回：无
 描述：
**************************************************************************************************/
uint8_t BSPPdb1GetIfStatus(void)
{
	uint8_t status;

	status = (PDB1->SC >> PDB_SC_PDBIF_SHIFT) & 0x01U;

	return status;
}
